docs/java/OOP.md.org
* Objet Oriented Programming (OOP)
:PROPERTIES:
:CUSTOM_ID: objet-oriented-programming-oop
:ID:       5f13e7ad-c431-4eba-b5b6-74a4b444efcc
:END:
** Benefits
:PROPERTIES:
:CUSTOM_ID: benefits
:END:
- Reduce Complexity
- Easier Maintenance
- Code reuse
- Faster Development

#+begin_src java
public class Pen {
    // Attributes
    String type = "Gel";
    String color = "Blue";
    byte point = 10;
    static boolean clicked = false;

    // Actions
    public static void click() {
        clicked = true;
    }

    public static void unclick() {
        clicked = false;
    }
}
#+end_src

* Inheritance
:PROPERTIES:
:CUSTOM_ID: inheritance
:END:

See [[id:dc175738-5133-433e-9867-ed8f858afbd7][Inheritance]]

#+begin_src java
// Hero
public class Hero {
  public static void kick() {
      System.out.println("Kick");
  }
  
  public static void punch() {
      System.out.println("Punch");
  }

  public static void powerUp() {
    System.out.println("Power Up!");
  }

  public static void powerDown() {
    System.out.println("Power Down!");
  }
}
#+end_src

#+begin_src java
// Hero1
public class Hero1 extends Hero {
    String suitColor = "Red";

    public static void setPower(int power) {
        System.out.println(power);
    }
}
#+end_src

#+begin_src java
// Hero2
public class Hero2 extends Hero {

    public static void setAgility(int agility) {
        System.out.println(agility);
    }
}
#+end_src

#+begin_src java
// Main
public class Main {
    
    public static void main(String[] args) {
       Hero1 hero1 = new Hero1();
       Hero2 hero2 = new Hero2();
       hero2.setAgility(20);
    //    hero1.setAgility(20); // Not allowed as setAgility does not exist on Hero1
    //    hero2.setPower(20); // Not allowed as setPower does not exist on Hero2
       hero1.setPower(15);
       hero1.punch();
       hero1.kick();
       hero1.powerDown();
       hero1.powerUp();
    }
}
#+end_src


* Encapsulation
See [[id:89e69431-4199-42ee-8633-4c2cc5da4d8a][Encapsulation]]

* Abstraction
See [[id:7b335bd0-f94e-4664-bcd1-880b87d72629][Abstraction]]

* Polymorphism
See [[id:e6c64b31-4ae6-4965-bf0c-de3df68799a3][Polymorphism]]
