OOP.md.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 Mon 08:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#objet-oriented-programming-oop">1. Objet Oriented Programming (OOP)</a>
<ul>
<li><a href="#benefits">1.1. Benefits</a></li>
</ul>
</li>
<li><a href="#inheritance">2. Inheritance</a></li>
<li><a href="#org614dc86">3. Encapsulation</a></li>
<li><a href="#org5bcf0eb">4. Abstraction</a></li>
<li><a href="#orgf392142">5. Polymorphism</a>
<ul>
<li><a href="#orgeeb7915">5.1. Problems</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-objet-oriented-programming-oop" class="outline-2">
<h2 id="objet-oriented-programming-oop"><span class="section-number-2">1.</span> Objet Oriented Programming (OOP)</h2>
<div class="outline-text-2" id="text-objet-oriented-programming-oop">
</div>
<div id="outline-container-benefits" class="outline-3">
<h3 id="benefits"><span class="section-number-3">1.1.</span> Benefits</h3>
<div class="outline-text-3" id="text-benefits">
<ul class="org-ul">
<li>Reduce Complexity</li>
<li>Easier Maintenance</li>
<li>Code reuse</li>
<li>Faster Development</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Pen</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">Attributes
</span>    <span class="org-type">String</span> <span class="org-variable-name">type</span> = <span class="org-string">"Gel"</span>;
    <span class="org-type">String</span> <span class="org-variable-name">color</span> = <span class="org-string">"Blue"</span>;
    <span class="org-type">byte</span> <span class="org-variable-name">point</span> = 10;
    <span class="org-keyword">static</span> <span class="org-type">boolean</span> <span class="org-variable-name">clicked</span> = <span class="org-constant">false</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">Actions
</span>    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">click</span>() {
        clicked = <span class="org-constant">true</span>;
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">unclick</span>() {
        clicked = <span class="org-constant">false</span>;
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-inheritance" class="outline-2">
<h2 id="inheritance"><span class="section-number-2">2.</span> Inheritance</h2>
<div class="outline-text-2" id="text-inheritance">
<p>
See <a href="Inheritance.md.html#ID-dc175738-5133-433e-9867-ed8f858afbd7">Inheritance</a>
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Hero
</span><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Hero</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">kick</span>() {
      System.out.println(<span class="org-string">"Kick"</span>);
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">punch</span>() {
      System.out.println(<span class="org-string">"Punch"</span>);
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">powerUp</span>() {
    System.out.println(<span class="org-string">"Power Up!"</span>);
  }

  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">powerDown</span>() {
    System.out.println(<span class="org-string">"Power Down!"</span>);
  }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Hero1
</span><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Hero1</span> <span class="org-keyword">extends</span> <span class="org-type">Hero</span> {
    <span class="org-type">String</span> <span class="org-variable-name">suitColor</span> = <span class="org-string">"Red"</span>;

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">setPower</span>(<span class="org-type">int</span> <span class="org-variable-name">power</span>) {
        System.out.println(power);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Hero2
</span><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Hero2</span> <span class="org-keyword">extends</span> <span class="org-type">Hero</span> {

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">setAgility</span>(<span class="org-type">int</span> <span class="org-variable-name">agility</span>) {
        System.out.println(agility);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">Main
</span><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Main</span> {

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
       <span class="org-type">Hero1</span> <span class="org-variable-name">hero1</span> = <span class="org-keyword">new</span> <span class="org-type">Hero1</span>();
       <span class="org-type">Hero2</span> <span class="org-variable-name">hero2</span> = <span class="org-keyword">new</span> <span class="org-type">Hero2</span>();
       hero2.setAgility(20);
    <span class="org-comment-delimiter">//    </span><span class="org-comment">hero1.setAgility(20); // Not allowed as setAgility does not exist on Hero1
</span>    <span class="org-comment-delimiter">//    </span><span class="org-comment">hero2.setPower(20); // Not allowed as setPower does not exist on Hero2
</span>       hero1.setPower(15);
       hero1.punch();
       hero1.kick();
       hero1.powerDown();
       hero1.powerUp();
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org614dc86" class="outline-2">
<h2 id="org614dc86"><span class="section-number-2">3.</span> Encapsulation</h2>
<div class="outline-text-2" id="text-3">
<p>
See <a href="Encapsulation.md.html#ID-89e69431-4199-42ee-8633-4c2cc5da4d8a">Encapsulation</a>
</p>
</div>
</div>

<div id="outline-container-org5bcf0eb" class="outline-2">
<h2 id="org5bcf0eb"><span class="section-number-2">4.</span> Abstraction</h2>
<div class="outline-text-2" id="text-4">
<p>
See <a href="Abstraction.md.html#ID-7b335bd0-f94e-4664-bcd1-880b87d72629">Abstraction</a>
</p>
</div>
</div>

<div id="outline-container-orgf392142" class="outline-2">
<h2 id="orgf392142"><span class="section-number-2">5.</span> Polymorphism</h2>
<div class="outline-text-2" id="text-5">
<p>
See <a href="Polymorphism.md.html#ID-e6c64b31-4ae6-4965-bf0c-de3df68799a3">Polymorphism</a>
</p>
</div>


<div id="outline-container-orgeeb7915" class="outline-3">
<h3 id="orgeeb7915"><span class="section-number-3">5.1.</span> Problems</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="20230723131600-fragile_base_class.html#ID-aa12b693-897b-480e-90ad-b0ff968ac909">Fragile Base Class</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
